#coding:utf8
"""
Purpose: 存储位置数据点
"""
# 位置点映射，值包括 x, y, w w:0前,1后,2左,3右
# locations = {
#     "A": [(1.51060724258, 0.143926501274, 0), (0.636, 0.771, 0)],
#     "B": [(0.636, 0.771, 0)]
# }
locations = {
    'A': {
        'id':1,
        'name':'总经办',
        'area':'A',
        'point':[(1.34, -12.0, 0)]
    },
    'B': {
        'id':2,
        'name':'总裁室',
        'area':'A',
        'point':[(5.33, -11.8, 0)]
    },
    'C': {
        'id':3,
        'name':'总经办',
        'area':'A',
        'point':[(7.04, -11.8, 0)]
    },
    'O':{
        'id':4,
        'name':'原点',
        'area':'A',
        'point':[(0.02, 0.01, 0)]
    }
}